Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.GetCenterPointsForConnectedGridCellsInSpaceVolume(System.Int32)
Returns the collection of connected cells in an enclosed space volume.
Remarks:
This method requires the building envelope analyzer method created with
the option set to compute enclosed space volumes.
Returns:
The center points for the connected analytical grid cells in the enclosed space volume.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.GetBoundingElementsForSpaceVolume(System.Int32)
Returns the collection of bounding building elements for an enclosed space volume.
Remarks:
This method requires the building envelope analyzer method created with
the option set to compute enclosed space volumes.
Returns:
The ids of the bounding building elements for the enclosed space volume.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.GetBoundingElements
Returns the collection of building elements exposed to the outside forming the building envelope.
Returns:
The ids of the building elements in the envelope.
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions)
Creates a new analyzer.
document:
The document that contains the physical model of the building.
options:
Options for the method analyzing the building elements for the building envelope.
Returns:
The created analyzer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer
Analyzes which elements are part of the building envelope, the building elements exposed to the outside.
Remarks:
This class uses a combination of ray-casting and flood-fill
algorithms in order to find the building elements that are
exposed to the outside of the building.
This method can also look for the bounding building elements for
enclosed space volumes inside the building.
Since:
2015